const regex = [
  {
    name: '常用编码',
    value: [
      {
        name: 'email地址',
        desc: '',
        value: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
      },
      {
        name: 'url地址',
        desc: '',
        value: /^[a-zA-z]+:\/\/(\w+(-\w+)*)(\.(\w+(-\w+)*))*(\?\S*)?$/,
      },
      {
        name: 'ipv4',
        desc: '',
        value: /((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)/,
      },
      {
        name: '中国邮政编码',
        desc: '',
        value: /[1-9]\d{5}(?!\d)/,
      },
      {
        name: '中国电话号码',
        desc: '',
        value: /(\d{3}-|\d{4}-)?(\d{8}|\d{7})?/,
      },
      {
        name: '15位身份证号',
        desc: '',
        value: /^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$/,
      },
      {
        name: '18位身份证号',
        desc: '',
        value: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
      }
    ]
  }
];

module.exports = regex;
